{
  "patent_id": "JP2022165707A",
  "title": "Electronic apparatus",
  "assignee": "Lenovo Singapore Pte Ltd",
  "description": "Description.Translated from.Japanese..BACKGROUND OF THE INVENTION 1. Field of the Invention The present invention relates to an electronic device in which a plurality of housings are relatively rotatably connected..Electro  Luminescence.For example, Patent Literature 1 discloses an electronic device in which not only the housing but also the display can be folded by using a flexible display such as organic EL (Electro Luminescence)...Japanese Patent No. 6636125..In the electronic device as described above, it is necessary to prevent the length of the display from changing when the housing rotates. Therefore, the housing usually has a center of rotation at a position that coincides with the surface of the display. For this reason, the wiring that connects the electronic components mounted on the left and right housings, respectively, expands and contracts due to the inner ring difference that occurs when the housings rotate. That is, the wiring is elongated when the display is folded, and has extra length when the display is opened...In the configuration of Patent Document 1, a groove is provided in the back cover member located at the boundary between the left and right housings, and the wiring is bent in the horizontal direction in the groove to absorb the extra length of the wiring. As described above, if the wiring is a general cable-like wiring in which a metal wire is covered with insulation, it is possible to absorb the expansion and contraction by simply bending it in the horizontal direction...By the way, when the amount of information to be transmitted and received between the left and right housings is large, and when general wiring becomes too thick, it is conceivable to use a flexible substrate. However, since the flexible substrate cannot be bent in the horizontal direction, the excess length cannot be absorbed by the structure of Patent Document 1 above. On the other hand, if the flexible substrate is extended between the left and right housings without considering the absorption of the excess length, the flexible substrate will flutter when the housings rotate, making it difficult to smoothly absorb the excess length. It should be noted that such a problem of excess length of the flexible substrate may also occur in a foldable electronic device that does not use a flexible display...SUMMARY OF THE INVENTION It is an object of the present invention to provide an electronic device that can smoothly absorb the excess length of a flexible substrate between housings that are relatively rotatably connected. With the goal...An electronic device according to a first aspect of the present invention includes a first housing mounted with a first electronic component; a second housing provided adjacent to the first housing and mounted with a second electronic component; The first housing and the second housing are relatively rotated between a first posture in which the first housing and the second housing are stacked so as to overlap each other in a plane direction and a second posture in which they are arranged in a direction perpendicular to the plane direction. a hinge device for releasable connection and provided between the first housing and the second housing so as to straddle adjacent ends of the first housing and the second housing; a flexible substrate connecting the first electronic component and the second electronic component, wherein the flexible substrate is provided at a position offset toward the first housing from the adjacent end, and the second housing and a first folded portion folded back from a first direction toward the first housing toward a second direction opposite to the first direction...An electronic device according to a second aspect of the present invention includes a first housing mounted with a first electronic component; a second housing provided adjacent to the first housing and mounted with a second electronic component; The first housing and the second housing are relatively rotated between a first posture in which the first housing and the second housing are stacked so as to overlap each other in a plane direction and a second posture in which they are arranged in a direction perpendicular to the plane direction. a hinge device for releasable connection and provided between the first housing and the second housing so as to straddle adjacent ends of the first housing and the second housing; a flexible substrate connecting the first electronic component and the second electronic component, wherein the flexible substrate is provided at a position offset toward the first housing from the adjacent end, and the second housing a first folded portion folded back in a second direction opposite to the first direction from the first direction toward the first housing, and after being folded back in the second direction at the first folded portion and a housing fixing portion provided at a position and fixed relative to the first housing...According to the aspect of the present invention, it is possible to smoothly absorb the extra length of the flexible substrate extending between the housings that are relatively rotatably connected...FIG. 1 is a perspective view showing a state in which an electronic device according to an embodiment is closed and in a 0-degree posture...FIG. 2 is a plan view schematically showing a state in which the electronic device shown in FIG. 1 is opened and placed in a 180-degree posture...3 is a plan view schematically showing the internal structure of the electronic device shown in FIG. 2. FIG...FIG. 4 is a schematic perspective cross-sectional view along line IV-IV in FIG...FIG. 5A is a schematic side cross-sectional view of the electronic device in a 180-degree posture...FIG. 5B is a schematic side cross-sectional view of the electronic device in a 60-degree posture...FIG. 5C is a schematic side cross-sectional view of the electronic device in the 0-degree orientation...FIG. 6A is a schematic perspective view of the flexible substrate viewed from the surface side of the display...FIG. 6B is a schematic perspective view of the flexible substrate viewed from the back side of the display...FIG. 7 is a side view schematically showing the state of the first folded portion and its peripheral portion in the 180-degree posture and the 0-degree posture...FIG. 8 is a side view schematically showing the state of the first folded portion and its peripheral portion of the flexible substrate according to the modification...BEST MODE FOR CARRYING OUT THE INVENTION An electronic device according to the present invention will be described in detail below with reference to preferred embodiments and with reference to the accompanying drawings...FIG. 1 is a perspective view showing a state in which an.electronic device.10 according to one embodiment is closed and in a 0-degree posture. FIG. 2 is a plan view schematically showing a state in which the.electronic device.10 shown in FIG. 1 is opened and placed in a 180-degree posture. 3 is a plan view schematically showing the internal structure of the.electronic device.10 shown in FIG. 2. FIG...As shown in FIGS. 1 to 3, the.electronic device.10 includes a.first housing.12A, a.second housing.12B, a.hinge device.14, and a.display.16. FIG. The.electronic device.10 of this embodiment exemplifies a tablet PC or a notebook PC that can be folded like a book. The.electronic device.10 may be a mobile phone, a smart phone, a portable game machine, or the like...Each.housing.12A, 12B is arranged adjacent to each other. Each of the.housings.12A and 12B is formed of, for example, a rectangular plate-like member having upright side walls on three sides other than the sides (adjacent end portions 12Aa and 12Ba) connected by the.hinge devices.14, respectively. Each of the.housings.12A and 12B is made of, for example, a metal plate such as stainless steel, magnesium, or aluminum, or a fiber-reinforced resin plate containing reinforcing fibers such as carbon fiber. The.hinge device.14 relatively rotatably connects the.housings.12A and 12B. The.hinge device.14 also functions as a back cover member that hides the gap between the adjacent ends 12Aa and 12Ba formed in the 0 degree posture shown in FIG. A.display.16 extends across the.housings.12A and 12B..Central  Processing  UnitSolid  State  Drive.As shown in FIG. 3, the.first housing.12A has electronic components such as a.mother board.17 mounted thereon. Electronic components such as a CPU (Central Processing Unit) 17a, a.communication module.17b, and an SSD (Solid State Drive) 17c are mounted on the.motherboard.17, for example. The.CPU.17 a performs calculations related to main control and processing of the.electronic device.10 . The.communication module.17b is, for example, a device that performs information processing of wireless communication transmitted and received via an antenna mounted on the.second housing.12B, and is compatible with, for example, wireless WAN and fifth generation mobile communication systems. The.SSD.17c is a storage device using semiconductor memory..Universal  Serial  Bus.The.second housing.12B mounts electronic components such as a.battery device.18 and a.sub card.19, for example. The.battery device.18 is a secondary battery that serves as a power source for the.electronic device.10 . The.sub card.19 is a board on which, for example, a power button, an external connector conforming to the USB (Universal Serial Bus) standard, and the like are mounted...The.housings.12A and 12B are electrically connected by, for example, three.flexible substrates.20, 21 and 22. As shown in FIG. The.flexible substrate.20 connects between the.motherboard.17 and the.battery device.18, for example. The.flexible substrate.21 connects between the.motherboard.17 and the.display.16, for example. The.flexible board.22 connects between the.motherboard.17 and the.sub card.19, for example. The.flexible substrates.20 to 22 may be connected to objects other than those described above. The number of.flexible substrates.20 to 22 to be installed can be changed as appropriate...The.electronic device.10 may mount the.motherboard.17 in the.second housing.12B and mount the.battery device.18 and the like in the.first housing.12A. In the.electronic device.10, the layout of each electronic component may be appropriately changed, for example, the.mother board.17 and the.sub card.19 are mounted in the.first housing.12A, and the.battery device.18 is mounted in the.second housing.12B. The flexible substrates 20 (21, 22) may be used for connections other than these electronic components...Hereinafter, regarding the.electronic device.10, the direction in which the.housings.12A and 12B are arranged is the X direction, the direction along the adjacent end portions 12Aa and 12Ba perpendicular thereto is the Y direction, and the thickness direction of the.housings.12A and 12B is the Z direction. call and explain. Regarding the X direction, the direction from the.second housing.12B to the.first housing.12A may be called the X1 direction, and the opposite direction from the.first housing.12A to the.second housing.12B may be called the X2 direction. Regarding the angular orientation between the.housings.12A and 12B, the state in which the.housings.12A and 12B are stacked so as to overlap each other in the plane direction is called a 0 degree orientation (see FIGS. 1 and 5C), and the direction perpendicular to the plane direction (X direction). The state of being lined up is called a 180-degree posture (see FIG. 5A). Postures between 0 degrees and 180 degrees are called by appropriately incrementing angles, and for example, the posture shown in FIG. 5B is called a 60-degree posture. These angles are for convenience of explanation, and it is natural that the actual product may have an angular position slightly deviated from the exact angular position indicated by the angle number. In the present embodiment, the description is made by calling it a 0-degree posture or the like...FIG. 4 is a schematic perspective cross-sectional view along line IV-IV in FIG. FIG. 4 representatively illustrates the configuration of the.flexible substrate.20 and its peripheral portion, but the configurations of the other.flexible substrates.21 and 22 and their peripheral portion are the same or similar to those shown in FIG. . Therefore, in the following, regarding the other.flexible substrates.21 and 22, the same or similar constituent elements as those of the.flexible substrate.20 are denoted by the same reference numerals, and detailed description thereof will be omitted..Flexible  printed  circuit.The.flexible substrates.20 to 22 are flexible printed circuits (FPCs) formed thinly and flexibly using, for example, a flexible insulating film. As shown in FIG. 3, the flexible substrate 20 (21, 22) has a.first end.20A on the side of the.first housing.12A connected to the.motherboard.17, and a.second end.20B on the side of the.second housing.12B connected to the battery. It is connected to the device 18 (.display.16, sub card 19). 6A and 6B illustrate a configuration in which the.second end.20B is connected to the.battery device.18 via the.cable.18a, but the battery device 18 (.display.16, It may be connected to a sub card 19)...5A, 5B, and 5C are schematic side cross-sectional views of.electronic device.10 in 180-degree, 60-degree, and 0-degree postures, respectively...As shown in FIGS. 5A to 5C, the.housings.12A and 12B are relatively rotatable between two angular postures (between the 0-degree posture and the 180-degree posture in this embodiment) by the.hinge device.14. movably connected. In the 0-degree posture shown in FIG. 5C, the.housings.12A and 12B are stacked so as to overlap each other in the plane direction. In the 180-degree posture shown in FIG. 5A, the.housings.12A and 12B are arranged side by side in a direction (X direction) perpendicular to the surface direction...The.display.16 is a flexible display that extends across the.housings.12A, 12B. In the 0-degree posture shown in FIG. 5C, the.display.16 is arranged such that the area RA on the side of the.first housing.12A and the area RB on the side of the.second housing.12B face each other. is bent in an arc shape. In the 180-degree posture shown in FIG. 5A, the.display.16 has the regions RA, RB and the bending region R1 arranged side by side on the XY plane, and forms a flat plate as a whole (see also FIG. 2)...The.display.16 has a.rear surface.16a supported by the.housings.12A and 12B and the.hinge device.14, and a.front surface.16b serving as an image display surface. The.display.16 is positioned on top of the.housings.12A and 12B in the Z direction. The.display.16 has a structure in which a sheet-.like member.16d is attached to the back surface of a.display panel.16c made of organic EL or the like...The.display.16 has an area RA relatively fixed to the.first housing.12A and an area RB relatively fixed to the.second housing.12B. Specifically, the.back surface.16a of the area RA is supported by the.first plate.24A and the.first support plate.27A, and fixed to the.first housing.12A via the.first plate.24A. The.back surface.16a of the region RB is supported by the.second plate.24B and the.second support plate.27B, and fixed to the.second housing.12B via the.second plate.24B..Support plates.27A and 27B are components of.hinge device.14 ...The bending region R1 is relatively movable with respect to the.housings.12A and 12B. In the 180-degree posture, the.back surface.16a of the bending area R1 is supported by the hinge.main body.26 and the.support plates.27A and 27B (see FIG. 5A). At the time of the 0-degree posture, the bending region R1 is bent in an arc shape, part of the.back surface.16a is supported by the.support plates.27A and 27B, and most of the.back surface.16a is separated from the hinge device 14 (see FIG. 5C)...The.plates.24A and 24B are plates made of carbon fiber reinforced resin or metal. The.plates.24A and 24B are arranged on the left and right so as to sandwich the.hinge device.14 therebetween, and support the.back surface.16a of the.display.16 on their respective surfaces...As shown in FIGS. 3, 4 and 5A, the.hinge device.14 of this embodiment has a.hinge body.26, a.first support plate.27A and a.second support plate.27B. The.hinge device.14 may be of any other configuration as long as the.hinge device.14 connects the.housings.12A and 12B in a relatively rotatable manner and the.display.16 can be bent into a desired bent shape...The hinge.main body.26 is provided at a position straddling the adjacent ends 12Aa and 12Ba of the.housings.12A and 12B (see FIG. 5A), and extends along the adjacent ends 12Aa and 12Ba along the Y direction substantially over the entire length. (see Figures 1 and 3). The hinge.main body.26 is a block-shaped part made of metal such as aluminum. The hinge.main body.26 is connected to a bracket fixed to the.first housing.12A via a first.rotary link.28A (see FIG. 3) so as to be relatively movable. Furthermore, the hinge.main body.26 is connected to a bracket fixed to the.second housing.12B via a second.rotating link.28B (see FIG. 3) so as to be relatively movable. Accordingly, the.hinge body.26 connects the.housings.11 and 12B so as to be relatively rotatable. A gear mechanism for synchronizing the rotational movement between the.housings.12A and 12B and a torque mechanism for applying a predetermined rotational torque to the rotational movement between the.housings.12A and 12B are also provided in the.hinge body.26. there is The outer surface of the.hinge body.26 is covered with a.decorative covering material.26a...In the 180-degree posture shown in FIG. 5A, the hinge.main body.26 is accommodated in the.housings.12A and 12B and straddles the adjacent ends 12Aa and 12Ba that are close to or in contact with each other in the X direction. At the 0 degree position shown in FIG. 5C, the.hinge body.26 is arranged to close the gap between the widely spaced adjacent ends 12Aa and 12Ba, and serves as the spine of the.electronic device.10 folded like a book. At this time, exposing the.cover material.26a to the outermost surface prevents deterioration of the appearance design of the folded electronic device 10 (see FIG. 1)...The.support plates.27A and 27B are plates made of a metal material such as aluminum, and have bilaterally symmetrical shapes. The.first support plate.27A is provided on the inner surface side of the.first housing.12A and extends substantially over the entire length in the Y direction along the adjacent end portion 12Aa. One end in the width direction (X direction) of the.first support plate.27A is connected to the hinge.main body.26 using a rotation shaft 27Aa so as to be relatively rotatable. The other end in the width direction of the.first support plate.27A is provided so as to be movable relative to the.first housing.12A, and is adjacent to one end of the.first plate.24A. Thereby, the.first support plate.27A is arranged between the hinge.main body.26 and the.first plate.24A in the 180-degree posture...The.second support plate.27B is provided on the inner surface side of the.second housing.12B and extends substantially over the entire length in the Y direction along the adjacent end portion 12Ba. One end of the.second support plate.27B is rotatably connected to the.hinge body.26 using a rotation shaft 27Ba, and the other end is adjacent to one end of the.second plate.24B. Thereby, the.second support plate.27B is arranged between the hinge.main body.26 and the.second plate.24B in the 180-degree posture...The.support plates.27A, 27B move relative to the inner surfaces 12Ab, 12Bb of the.housings.12A, 12B in the X direction and the Z direction according to the rotational movement between the.housings.12A, 12B. The.support plates.27A and 27B support the.rear surface.16a of the.display.16 with their surfaces when in the 180-degree posture. At angles other than 180 degrees, the.support plates.27A and 27B contact the.display.16 with a gap between them or the.display.16 with a slight force that does not deform the.display.16 . The.support plates.27A and 27B may be configured to support the bending region R1 of the.display.16 and correct its shape even at an angle posture other than 180 degrees. In this manner, the.support plates.27A and 27B stably support the folding region R1 of the.display.16 in the 180-degree posture, while not hindering the folding operation of the folding region R1...Next, a specific configuration of the flexible substrate 20 (21, 22) will be described. 6A is a schematic perspective view of the.flexible substrate.20 viewed from the surface side of the.display.16. FIG. FIG. 6B is a schematic perspective view of the.flexible substrate.20 viewed from the back side of the.display.16. FIG...As shown in FIGS. 4, 6A, and 6B, the flexible board 20 (21, 22) includes a first folded.portion.20a, a second folded.portion.20b, a.hinge fixing portion.20c, and a first.housing fixing portion.20d. , a second.housing fixing portion.20e, a first.bent portion.20f, and a second.bent portion.20g...The first folded.portion.20a is formed in a substantially U shape when viewed from the side by folding back the.flexible substrate.20 from the X1 direction to the X2 direction. The first folded.portion.20a is provided at a position offset toward the.first housing.12A side (X1 side) from the adjacent end portions 12Aa and 12Ba. Specifically, the first folded.portion.20a is arranged on the X1 side of the.first support plate.27A, and positioned in the space S1 between the back surface of the.first plate.24A and the inner surface 12Ab of the.first housing.12A. there is The first folded.portion.20a is folded back from the X1 direction to the X2 direction while gradually moving away from the.rear surface.16a of the.display.16 with respect to the Z direction. In other words, the first folded.portion.20a is folded from top to bottom with reference to the direction from the.second end portion.20B of the.flexible substrate.20 toward the.first end portion.20A...The second folded.portion.20b is basically bilaterally symmetrical with the first folded.portion.20a. That is, the second folded.portion.20b is arranged on the X2 side of the adjacent ends 12Aa and 12Ba, and positioned in the space S2 between the.second plate.24B and the inner surface 12Bb of the.second housing.12B. The second folded.portion.20b is folded downward from the X2 direction to the X1 direction...The.hinge fixing portion.20c is a portion provided between the folded.portions.20a and 20b. The.hinge fixing portion.20c extends along the X direction and straddles the.hinge device.14 and the adjacent ends 12Aa and 12Ba. The.hinge fixing portion.20c extends from the back surface 27Ab of the.first support plate.27A through the.back surface.26b of the.hinge body.26 to the back surface 27Bb of the.second support plate.27B. As shown in FIG. 6A, an.adhesive member.30 is provided on the surface 20ca of the.hinge fixing portion.20c. The.adhesive member.30 is a double-sided tape, an adhesive, or the like. The.hinge fixing portion.20 c is fixed to the.hinge device.14 via the.adhesive member.30 ...The first.housing fixing portion.20d is provided at a position after being folded back from the X1 direction to the X2 direction at the.first folding portion.20a. The.flexible substrate.20 of the present embodiment is bent from the X direction to the Y direction by the first.bent portion.20f between the first folded.portion.20a and the.motherboard.17. As shown in FIG. The first.housing fixing portion.20d is provided at a portion bent at the first.bent portion.20f and extends in the Y direction. As shown in FIG. 6B, the.adhesive member.30 is also provided on the rear surface 20da of the first.housing fixing portion.20d. The first.housing fixing portion.20d is relatively fixed to the.first housing.12A via an.adhesive member.30. As shown in FIG...The second.housing fixing portion.20e basically has a symmetrical structure with the first.housing fixing portion.20d. That is, the second.housing fixing portion.20e is provided at a portion bent from the X direction to the Y direction by the.second bending portion.20g after being folded back from the X2 direction to the X1 direction by the.second folding portion.20b. As shown in FIG. 6B, the second.housing fixing portion.20e is also relatively fixed to the.second housing.12B via an.adhesive member.30 provided on the rear surface 20ea...The first.bent portion.20f is a portion bent from the X direction to the Y direction after being bent from the X1 direction to the X2 direction at the first folded.portion.20a. The flexible substrate 20 (21, 22) is folded back from the X1 direction toward the.motherboard.17 to the opposite X2 direction at the first folded.portion.20a. The first.bent portion.20f is a portion for directing the flexible substrate 20 (21, 22) folded back in the X2 direction at the first folded.portion.20a toward the.motherboard.17 again. In the configuration example shown in FIG. 6A, the.first end portion.20A, which is the connection portion to the.motherboard.17, is bent in the Y direction at the first.bent portion.20f, and is further bent in the X1 and Y directions. The.first end portion.20A may be provided immediately after bending in the Y direction at the.first bending portion.20f, or immediately after bending in the X1 direction...The second.bent portion.20g basically has a symmetrical structure with the first.bent portion.20f. That is, the second.bent portion.20g bends the position after being folded back from the X2 direction to the X1 direction at the second folded.portion.20b from the X direction to the Y direction. As a result, the second.bent portion.20g directs the flexible substrate 20 (21, 22) toward the.battery device.18 and the like again. In the configuration example shown in FIG. 6A, the.second end portion.20B, which is the connection portion to the.battery device.18 and the like, is bent in the Y direction at the second.bent portion.20g and is further bent in the X1 direction. The arrangement of the.second end portion.20B can also be changed as appropriate...As shown in FIG. 3, the.flexible substrates.21 and 22 are different from the.flexible substrate.20 in that the total length is different and the bending directions of the bending.portions.20f and 20g are different. can be the same...Next, the mounting structure of the flexible substrates 20 (21, 22) to the.housings.12A, 12B will be described...As shown in FIGS. 4 and 5A, the.first housing.12A of this embodiment is provided with an.upright piece.32 and a.support bar.33. As shown in FIGS. The standing.piece.32 is a plate piece that extends in the X1 direction while standing in a stepped manner from the inner surface 12Ab. The standing.piece.32 extends in the Y direction within the space S1. The.support bar.33 is a plate that is narrow in the X direction and thin in the Z direction and fixed to the inner surface 12Ab by screws or the like. The.support bar.33 extends in the Y direction within the space S1 and is parallel to the tip horizontal portion of the standing.piece.32 with a gap therebetween. The standing.piece.32 and the.support bar.33 are also provided on the.second housing.12B. In the case of the present embodiment, the.upright pieces.32 and the support bars 33 of the.second housing.12B have substantially bilaterally symmetrical structures with those of the.first housing.12A, but the structures are slightly different...First, as shown in FIGS. 4 and 5A, the.hinge fixing portion.20c of the flexible substrate 20 (21, 22) is attached to the.back surfaces.26b, 27Ab, 27Bb of the hinge.main body.26 and the.support plates.27A, 27B using the.adhesive member.30. Fixed. The.hinge fixing portion.20c may be fixed to only a part of the hinge.main body.26 and the.support plates.27A and 27B, or may be fixed with screws or hooks...Next, the portion of the flexible substrate 20 (21, 22) closer to the.first housing.12A than the.hinge fixing portion.20c is extended from the back surface 27Ab of the.first support plate.27A to the back surface of the.first plate.24A and the surface of the.upright piece.32. 32a to reach the first folded.portion.20a. This portion is free to move and is not fixed to the.first plate.24A or the standing.piece.32. As shown in FIG...At the first folded.portion.20a, the flexible substrate 20 (21, 22) is folded back from top to bottom in the X1 direction to the X2 direction while being free to move. The first folded.portion.20 a is formed in a U shape in side view and wraps around the.outer end surface.32 b of the.upright piece.32 . The first.bent portion.20f and the first.housing fixing portion.20d after being folded back in the X2 direction at the first folded.portion.20a are sandwiched between the.rear surface.32c of the.upright piece.32 and the.front surface.33a of the.support bar.33. placed in The.back surface.20 da of the first.housing fixing portion.20 d is fixed to the.surface.33 a of the.support bar.33 via the.adhesive member.30 ...Next, the portion of the flexible substrate 20 (21, 22) closer to the.second housing.12B than the.hinge fixing portion.20c is extended from the back surface 27Bb of the.second support plate.27B to the back surface of the.second plate.24B and the surface of the.upright piece.32. 32a to reach the second folded.portion.20b. This portion is also freely movable and is not fixed to the.second plate.24B or the standing.piece.32. As shown in FIG...At the second folded.portion.20b, the flexible substrate 20 (21, 22) is folded back from top to bottom in the X2 direction to the X1 direction while being free to move. The second.bent portion.20g and the second.housing fixing portion.20e after being folded back in the X1 direction at the second folded.portion.20b are positioned between the.rear surface.32c of the.upright piece.32 and the.front surface.33a of the.support bar.33. placed in The rear surface 20eda of the second.housing fixing portion.20e is fixed to the.surface.33a of the.support bar.33 via the.adhesive member.30. As shown in FIG...As described above, the flexible substrate 20 (21, 22) has the.hinge fixing portion.20c fixed to the.hinge device.14 and the first.housing fixing portion.20d relatively fixed to the.first housing.12A, and is positioned between them. The first folded.portion.20a and its peripheral portion are in a freely movable state. Further, the flexible substrate 20 (21, 22) has a.hinge fixing portion.20c fixed to the.hinge device.14, a second.housing fixing portion.20e relatively fixed to the.second housing.12B, and a second housing between them. The folded.portion.20b and its peripheral portion are in a state of being free to move...Next, the rotation operation of the.housings.12A and 12B and the operation of the flexible substrates 20 (21 and 22) at that time will be described...In the 180-degree posture shown in FIG. 5A, the.plates.24A and 24B, the.hinge body.26, and the.support plates.27A and 27B are aligned on the same XY plane, and their surfaces are arranged flush to form a flat plate as a whole. do. The.entire back surface.16a of the.display.16 is supported on this flat plate to form a large flat screen (see also FIG. 2)..Reference numeral.36 in FIG. 2 denotes a bezel member, which is a frame-shaped cover member for the non-active area on the periphery of the.surface.16b of the.display.16. As shown in FIG. In this manner, the.electronic device.10 functions as a large-screen tablet PC when in the 180-degree posture...Next, a case where the.housings.12A and 12B are rotated from the 180-degree posture toward the 0-degree posture will be described. In this case, as the.housings.12A and 12B are opened, the.support plates.27A and 27B swing about the rotation shafts 27Aa and 27Ba and move relative to the.housings.12A and 12B (FIGS. 5A to 5C). See FIG. 5C). The.housings.12A and 12B are relatively moved in directions (X1 and X2 directions) away from the.support plates.27A and 27B, respectively. At this time, the.plates.24A and 24B operate integrally with the.housings.12A and 12B. As a result, the.display.16 fixed to the.plates.24A and 24B is gradually opened at the folding region R1...At the 0-degree posture shown in FIG. 5C, the.housings.12A and 12B are in a highly designed folded state in which the plane directions of the.housings.12A and 12B are substantially parallel to each other. At this time, the.display.16 has a bell shape in which the bending region R1 is curved with a desired curvature. That is, the.display.16 is bent in a desired bell shape in the bending region R1 by the.plates.24A and 24B which are laminated in parallel with a predetermined gap therebetween. As a result, in the.electronic device.10, the.housings.12A and 12B are made as thin as possible, and damage to the.display.16 when it is bent is suppressed...During such pivoting movement, the.display.16 should not change its length. This is because if the.display.16 receives an expansion/contraction load, there is a concern that damage or malfunction may occur. Therefore, in the.electronic device.10, the rotation center between the.housings.12A and 12B is aligned with the.surface.16b of the.display.16, thereby suppressing the expansion/contraction load when the.display.16 is bent...On the other hand, the flexible substrates 20 (21, 22) located below the.display.16 and outside the rotation center are subjected to expansion and contraction. That is, when changing from the 180-degree posture to the 0-degree posture, the flexible substrate 20 (21, 22) receives a tensile force. When changing from the 0-degree posture to the 180-degree posture, the flexible substrate 20 (21, 22) receives a compressive force. The flexible substrate 20 (21, 22) of this embodiment absorbs this expansion and contraction by the folded.portions.20a, 20b...FIG. 7 is a side view schematically showing the state of the first folded.portion.20a and its peripheral portion in the 180-degree posture (180) and the 0-degree posture (0)...As shown in FIGS. 5A and 7, in the 180-degree posture, the first folded.portion.20a forms an.extra length portion.38 that is largely separated from the.outer end surface.32b of the standing piece 332 in the X1 direction. The first folded.portion.20a is freely movable between the.hinge fixing portion.20c and the first.housing fixing portion.20d. When rotating from the 180-degree posture to the 0-degree posture, the.first housing.12A moves away from the.hinge device.14 in the X1 direction. Therefore, when rotating from the 180-degree posture to the 0-degree posture, the.extra length portion.38 is gradually sent out in the X2 direction between the.hinge fixing portion.20c and the first.housing fixing portion.20d. As a result, the margin of the.extra length portion.38 is reduced in the 0-degree posture, and the first folded.portion.20a approaches the.outer end surface.32b of the upright piece 332. As shown in FIG...Note that when rotating from the 0-degree posture to the 180-degree posture, the.first housing.12A relatively moves in the X2 direction so as to approach the.hinge device.14 . Therefore, when rotating from the 0-degree posture to the 180-degree posture, the.extra length portion.38 is gradually sent out in the X1 direction between the.hinge fixing portion.20c and the first.housing fixing portion.20d. As a result, in the 180-degree posture, the margin of the.extra length portion.38 increases again, and the first folded.portion.20a separates from the.outer end surface.32b of the standing piece 332. As shown in FIG...A stroke S shown in FIG. 7 is a movement stroke of the flexible substrate 20 (21, 22) by the first folded.portion.20a, and is about 4 mm, for example. The operation of the second folded.portion.20b is the same as that of the first folded.portion.20a except that it is left-right symmetrical, so a detailed description thereof will be omitted...As described above, in the.electronic device.10 according to this embodiment, the flexible substrate 20 (21, 22) includes the folded.portions.20a, 20b. As a result, it is possible to smoothly absorb the excess length (excess length portion 38) caused by the expansion and contraction motion of the flexible substrates 20 (21, 22) accompanying the rotational motion between the.housings.12A, 12B. In addition, by adopting a configuration in which the extra length of the flexible substrate 20 (21, 22) is absorbed by the.folding portions.20a, 20b along the alignment direction (X direction) of the.housings.12A, 12B, reproducibility of the shape of the.extra length portion.38 is improved. easy to secure...Here, let us consider a configuration that does not have the folded.portions.20a and 20b. With this configuration, the extra length of the flexible substrate cannot be controlled. For this reason, in this configuration, there is a concern that the flexible substrate will appropriately form, for example, a wavy shape or a bent shape in the gap in the housing when it is in the 180-degree posture, and will take a different shape each time it rotates. As a result, in this configuration, there is a concern that the flexible substrate will receive a large load during expansion and contraction, and there is also the problem that the thickness of the housing must be increased to absorb the excess length. Furthermore, there is a concern that the flexible substrate remaining in the 180-degree posture may run wild in the housing and get caught on other members or parts, hindering the pivotal movement to the 0-degree posture, or the connector portion of the flexible substrate may come off...Only one of the folded.portions.20a and 20b may be provided. However, in this configuration, it is necessary to absorb all the surplus length of the flexible substrate 20 (21, 22) only by one folded portion, for example, the first folded.portion.20a. Therefore, the stroke S in FIG. 7 is doubled, and it becomes more difficult to secure the movement space. In this configuration, flexible substrate 20 ( 21 , 22 ) must be able to move smoothly relative to hinge.device.14 . That is, in this configuration, it is necessary not to fix the.hinge fixing portion.20 c to the.hinge device.14 . However, as shown in FIGS. 4 and 5A, the.hinge device.14 is concentrated in the thin Z-direction thickness of the.housings.12A and 12B. Therefore, in this configuration, it is necessary to slide the flexible substrate 20 (21, 22) on the.hinge device.14 without being caught at all, which complicates manufacturing and design...On the other hand, in the configuration provided with the left and right folded.portions.20a and 20b, the stroke S handled by each folded.portion.20a and 20b may be halved, and it is easy to secure the movement space for the folded.portions.20a and 20b. Moreover, there is no need to consider that the flexible substrate 20 (21, 22) may be caught by the.hinge device.14, and manufacturing and design are easy...In particular, the.electronic device.10 has the folded.portions.20a and 20b for absorbing the excess length arranged between the.hinge fixing portion.20c and the.housing fixing portions.20d and 20e. Therefore, it is possible to more smoothly control the operations of the folded.portions.20a and 20b when absorbing the excess length, and to further ensure the reproducibility of the shape of the.excess length portion.38. FIG. Although the.hinge fixing portion.20c and the.housing fixing portions.20d and 20e may be omitted, providing at least one of them improves the stability when absorbing the excess length...The folded.portions.20a and 20b are configured to be folded back from top to bottom. As a result, the.folding portions.20a and 20b can smoothly fold back the flexible substrate 20 (21 and 22) extending from the.hinge device.14, and the thickness can be easily reduced. Also, the.motherboard.17 and the.battery device.18 to which the flexible substrates 20 (21, 22) are connected are located below the.plates.24A, 24B. Therefore, folding back the folded.portions.20a and 20b from top to bottom facilitates connection to the.motherboard.17 and the like. The folded.portions.20a and 20b may be configured to be folded back from bottom to top...FIG. 8 is a side view schematically showing the state of the first folded.portion.20a of the flexible substrate 20 (21, 22) and its peripheral portion according to the modification. The configuration shown in FIG. 8 may be horizontally reversed and used for the second folded.portion.20b and its peripheral portion...The flexible board 20 (21, 22) shown in FIG. 8 includes a third folded.portion.40 between the first folded.portion.20a and the.motherboard.17 instead of the first.bent portion.20f. The third folded.portion.40 serves to turn the flexible substrate 20 (21, 22), which has been oriented in the opposite direction from the.mother board.17 side by the first folded.portion.20a, toward the.mother board.17 side again. The third folded.portion.40 is provided immediately after the first.housing fixing portion.20d and folded back from the X2 direction to the X1 direction from top to bottom...The third folded.portion.40 has the advantage of being able to reduce the space occupied by the flexible substrate 20 (21, 22) in the Y direction as compared with the case where the first.bent portion.20f is used. However, for devices such as the.electronic device.10 of the present embodiment, there is a great demand for.thinner casings.12A and 12B. Therefore, in terms of thickness reduction, the configuration using the first.bent portion.20f is more advantageous than the configuration using the third folded.portion.40, which requires a large space in the thickness direction (Z direction). be...It goes without saying that the present invention is not limited to the above-described embodiments, and can be freely modified without departing from the gist of the present invention...In the above, the.electronic device.10 that can be folded in half like a book was exemplified. A double-sided structure in which small housings are connected in a foldable manner, an S-shaped folding structure in which housings with different folding directions are connected to the left and right edges of one housing, and one left and right edge of a large housing. It can be applied to various configurations such as a J-shaped folding configuration in which a small housing is foldably connected to the housing, and the number of housings to be connected may be four or more..  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .REFERENCE SIGNS.LIST.10.electronic device.12A.first housing.12B.second housing.14.hinge device.16.display.17.motherboard.18.battery device.19 sub card 20-22.flexible substrate.20a first folded.portion.20b second folded.portion.20c.hinge fixing portion.20d first housing Fixed.portion.20e Second housing fixed.portion.20f First.bent portion.20g Second bent portion"
}