{
  "patent_id": "JP6857804B2",
  "title": "dishwasher",
  "assignee": "Panasonic Intellectual Property Management Co Ltd",
  "description": "Description.Translated from.Japanese..The present invention relates to a dishwasher having a structure in which a tableware basket on which an object to be washed such as tableware is placed is pulled out forward from a washing tank...In a conventional dishwasher, a tray is provided in a dish basket that is pulled out from the washing tub forward as the door is pulled out forward, and the back surface of the tray is relatively slid to adhere to the back surface. It was provided with a water droplet removing portion for wiping off water droplets (see, for example, Patent Document 1)...In addition, a water pan, which is provided below the dishwasher and whose tip is fixed to the lower part of the inner surface of the front door, extends rearward like a cantilever at a position below the bottom of the washing tank during the washing process. There is also a machine (see, for example, Patent Document 2)...Japanese Unexamined Patent Publication No. 2008-119205..JP-A-2009-106527..However, in a dishwasher having a water droplet removing portion, a phenomenon occurs in which contact variation occurs between the water droplet removing portion and the back surface of the tray, or the water droplets on the back surface of the tray cannot be wiped off due to wear due to repeated sliding. As a result, when the door is pulled out, there is a problem that water droplets on the back surface of the tray fall on the floor surface...Further, in the dishwasher in which the water tray is provided below the bottom of the washing tank during the washing step, the water tray is not washed during the washing step. For this reason, there is also a problem that dirt that has fallen from the object to be washed to the water tray accumulates, and the space under the washing tank in which the water tray and the water tray are stored becomes an unclean environment...The present invention solves the above-mentioned conventional problems, and an object of the present invention is to provide a hygienic dishwasher in which water droplets do not fall on the floor surface and dirt does not accumulate to create an unclean environment. ....In order to solve the conventional problems, the dishwashing machine of the present invention includes a washing tank having a front opening, a door body that covers the front opening of the washing tank and can be pulled out forward, and the washing tank. It is pulled out together with the cleaning space formed by the door body, the tableware basket stored in the cleaning space, the cleaning nozzle for cleaning the object to be cleaned such as the tableware stored in the tableware basket, and the door body. A main tray and an auxiliary tray are provided, the main tray is provided below the tableware basket in the washing space, and the auxiliary tray is provided below the main tray and outside the washing space. .....As a result, when the door body is pulled out forward, the main tray washed in the washing process directly receives the dirt that falls from the dishes, and only the water droplets adhering to the back surface of the main tray can be received by the auxiliary tray. Can be prevented from falling on the floor surface, and since only water droplets fall on the auxiliary tray, dirt does not accumulate and the space where the auxiliary tray and auxiliary tray are stored does not become an unclean environment. Dishwasher can be provided...The dishwasher of the present invention can provide a hygienic dishwasher in which water droplets do not fall on the floor surface and dirt does not accumulate to create an unclean environment...Perspective view of the state where the door body of the dishwasher according to the first embodiment of the present invention is pulled out forward...Side sectional view of the door body of the dishwasher according to the first embodiment of the present invention in a state of being pulled out forward...Side sectional view of the dishwasher according to the first embodiment of the present invention in a closed state...Front sectional view of a main part in a state where the door body of the dishwasher according to the first embodiment of the present invention is closed...(A) Front sectional view of a main part near the slide rail in a state where the door body of the dishwasher in the first embodiment of the present invention is closed (b) The auxiliary tray of the dishwasher in the first embodiment of the present invention is removed. Cross-sectional view of the main part with the door body pulled out forward..(A) Cross-sectional view of a main part near the auxiliary tray in a state where the door body of the dishwasher according to the first embodiment of the present invention is closed (b) The door body of the dishwasher according to the first embodiment of the present invention is forward. Cross-sectional view of the main part near the auxiliary tray in the pulled out state..A plan sectional view of a main part in the vicinity of the main tray in a state where the door body of the dishwasher according to the first embodiment of the present invention is pulled out forward...Side sectional view showing the flow of washing water in the washing step of the dishwasher according to the first embodiment of the present invention...The dishwasher of the first invention is formed by a washing tub having a front opening, a door body that covers the front opening of the washing tub and can be pulled out forward, and the washing tub and the door body. It is provided with a washing space, a tableware basket stored in the washing space, a washing nozzle for washing dishes and other objects to be washed stored in the tableware basket, and a main tray and an auxiliary tray that are pulled out together with the door body. The main tray is provided below the tableware basket in the washing space, and the auxiliary tray is provided below the main tray and outside the washing space...With this configuration, when the door body is pulled out, the main tray washed in the washing step directly receives the dirt falling from the object to be cleaned, and only the water droplets adhering to the back surface of the main tray can be received by the auxiliary tray. It is possible to prevent water droplets from falling on the floor surface, and since only water droplets fall on the auxiliary tray, dirt does not accumulate and the space where the auxiliary tray and auxiliary tray are stored does not become an unclean environment. A hygienic dishwasher can be provided...In the second invention, in particular, in the first invention, the auxiliary tray is configured to have a width dimension in the left-right direction larger than that of the main tray. With this configuration, when the door body is pulled out, water droplets falling from the back surface of the main tray can be reliably received by the auxiliary tray, and water droplets can be prevented from falling on the floor surface...The third invention is configured so that the tableware basket is pulled out together with the door body, particularly in the first or second invention. With this configuration, the tableware basket is pulled forward only by the action of the user pulling out the door body, and the user can set the object to be washed in the tableware basket without having to bother to pull out the tableware basket...In the fourth invention, in particular, in any one of the first to third inventions, at least one of the main tray or the auxiliary tray is removable. With this configuration, the user can remove the tray and wash it completely, and the tray can be kept hygienic...The fifth invention, in particular, in any one of the first to fourth inventions, allows the user to access the gap between the main tray and the auxiliary tray when the door body is pulled out. It is composed of intervals. With this configuration, the user can easily clean the lower surface of the main tray and the upper surface of the auxiliary tray by putting a hand between the main tray and the auxiliary tray without removing the main tray, and the main tray and the auxiliary tray can be cleaned. Can be kept hygienic...In the sixth invention, in particular, in any one of the first to fifth inventions, the auxiliary tray is composed of a plurality of trays. With this configuration, when the door body is closed, the area occupied by the auxiliary tray in the horizontal direction can be reduced, and a large space for a drain port, a washing drain pump, and the like can be secured...A seventh invention, in particular, in the sixth invention, a plurality of trays of the auxiliary tray are stacked and stored in the vertical direction when the door body covers the front opening of the washing tank. When the door body is pulled out, it is deployed in the pulling direction. With this configuration, it is possible to secure a wide space for a drain port, a washing drain pump, and the like without bending or bending the auxiliary tray, and it is possible to provide a small dishwasher...The eighth invention, in particular, in the seventh invention, a plurality of trays of the auxiliary tray has an overlap portion between the plurality of trays when the door body is pulled out and deployed in the pull-out direction. Is. With this configuration, even when the door body is pulled out to the front limit, it is possible to prevent the rear tray among the plurality of trays from becoming unstable and tilting or coming off. In addition, it is possible to prevent the washing water that falls on the front tray from falling onto the floor surface...A ninth aspect of the invention, particularly in the seventh or eighth aspect, is that the door body is pulled out from the rearmost end of the plurality of trays of the auxiliary tray, and the plurality of trays of the auxiliary tray are expanded in the drawing direction. Occasionally, the position is restricted behind the front surface of the cleaning tank. With this configuration, the rearmost tray does not come off the washing tank forward. Further, since the rear end of the rearmost tray does not protrude from the front of the washing tank to the front, it is possible to prevent the washing water from falling from the tableware basket from falling onto the floor surface...A tenth invention, particularly in any one of the first to ninth inventions, is formed or arranged such that the upper surface of the bottom portion of the main tray is inclined downward toward the rear, and the upper surface of the bottom portion is formed and arranged at the rear portion. A tray outlet is provided so as to penetrate the lower surface. With this configuration, the cleaning water and water droplets falling on the main tray can be reliably guided into the cleaning tank by the inclination of the upper surface of the bottom surface of the main tray and the tray outlet, not only during the cleaning but also after the cleaning is completed. As a result, during cleaning, the circulation of the cleaning water can be improved and the cleaning performance can be improved. In addition, after the cleaning is completed, the cleaning water and water droplets that fall on the main tray can be quickly removed from the main tray and moved into the cleaning tank, and when the door body is pulled out, the cleaning water can be removed. And water droplets can be prevented from falling on the floor surface....The eleventh invention, in particular, in the tenth invention, the tray outlet is located behind the front surface of the washing tank when the door body is completely pulled out. With this configuration, even when the door body is completely pulled out, the washing water and water droplets falling on the main tray can be reliably stored in the washing tank. Therefore, regardless of the position of the main tray that is pulled out together with the door body, the washing water and water droplets that fall on the main tray can be reliably moved into the washing tank by the tray outlet, and the door body is pulled out. At that time, it is possible to prevent the washing water that falls from the tableware basket from falling onto the floor surface...A twelfth invention, in particular, in the tenth or eleventh invention, the main tray is provided with a leftover filter for collecting leftovers contained in the washing water at the outlet of the tray. By pulling out the leftovers filter forward together with the door body, the user can easily process the leftovers. In addition, since the leftovers filter is installed on the upstream side of the flow of washing water from the drainage filter located at the bottom of the washing tank, the accumulation of leftovers on the drainage filter, which is difficult to treat leftovers, is reduced and used. It is possible to reduce the labor of processing leftovers by the person...A thirteenth invention particularly in any one of the first to the twelfth inventions, wherein the main tray includes a rolling support portion that supports the main tray while rolling with respect to the washing tank. is there. With this configuration, even in a configuration in which the main tray is cantilevered and supported by the door body, the main tray can be smoothly moved back and forth while being stably supported. As a result, when the main tray is pulled forward together with the door body, the vibration of the main tray can be suppressed, and the water droplets adhering to the main tray can be suppressed from scattering to the surroundings. Further, during cleaning, it is possible to suppress deformation of the main tray with respect to the load of the washing water falling on the main tray, and prevent the back surface of the main tray from being immersed in the washing water flowing into the inner bottom of the washing tank...In the fourteenth invention, in particular, in any one of the first to thirteenth inventions, a washing water introduction portion for introducing washing water into the main tray is provided on the inner surface of the left and right side walls of the washing tank. It is a thing. With this configuration, the washing water applied to the inner surfaces of the side walls on both the left and right sides of the washing tank during washing is introduced into the main tray, passes through the tray outlet, and flows down to the inner bottom of the washing tank. Therefore, it is possible to prevent the washing water during washing from flowing into the gap between the main tray and the wall surface of the washing tank and adhering dirt and leftovers to the peripheral edge of the main tray. In addition, the amount of washing water flowing on the main tray can be stabilized, and leftovers and dirt can be prevented from remaining on the main tray. In addition, even after cleaning, the cleaning water that falls on the cleaning water introduction portion along the inner surfaces of the side walls on both the left and right sides of the cleaning tank is also guided onto the main tray, and water droplets and leftovers are formed on the periphery of the main tray. It is possible to prevent it from adhering and falling on the floor surface...A fifteenth invention, particularly in the fourteenth invention, is such that the washing water introduction portion is provided above the main tray so as to cover the peripheral edge of the main tray. With this configuration, the washing water during washing is surely introduced onto the main tray and flows into the gap between the main tray and the wall surface of the washing tank to prevent leftovers and dirt from adhering to the periphery of the main tray. it can...A sixteenth invention, particularly in the fourteenth or fifteenth invention, is such that the washing water introduction portion is provided above the tray rail so as to cover the tray rail on which the main tray moves. With this configuration, it is possible to prevent leftovers and dirt from adhering to the tray rail and hindering the movement of the main tray in the front-rear direction...In the seventeenth invention, in particular, in any one of the fourteenth to sixteenth inventions, the washing water introduction portion is provided so as to be inclined downward toward the rear. With this configuration, the washing water applied to the inner side surfaces of the left and right side walls of the washing tank during washing is introduced as concentrated as possible in the rear part of the main tray provided with the tray outlet and the leftover filter, and the washing tank is introduced. It can be dropped to the inner bottom. As a result, it is possible to prevent leftovers and dirt from remaining on the upper surface of the main tray. In addition, it is possible to prevent water droplets, leftovers, and dirt from remaining on the surface of the washing water introduction portion after washing....The eighteenth invention, in particular, in any one of the fourteenth to seventeenth inventions, is that the washing water introduction portion is provided so as to be inclined downward toward the inside of the washing tank. With this configuration, the cleaning water applied to the inner side surfaces of the side walls on both the left and right sides of the cleaning tank during cleaning can be reliably guided onto the main tray. In addition, it is possible to prevent water droplets, leftovers, and dirt from remaining on the surface of the washing water introduction portion after washing...Hereinafter, embodiments of the present invention will be described with reference to the drawings. The present invention is not limited to this embodiment....(Embodiment 1).FIG. 1 is a perspective view of a state in which the door body of the dishwasher according to the first embodiment of the present invention is pulled out forward. As shown in FIG. 1, the.dishwasher.1 includes a.washing tank.3 having a.front opening.2, a.door body.4 that covers the.front opening.2 of the.washing tank.3 and can move back and forth, and the.washing tank.3 and a door. The cleaning.space.5 formed by the.body.4 and the.lower tableware basket.7 and the upper tableware basket, which are housed in the.cleaning space.5 and on which the object to be cleaned 6 is placed and which can be moved back and forth and are made of metal wire, are used. Equipped with 8...An.operation unit.9 is provided on the upper surface of the.door body.4. By pressing the button on the.operation unit.9, the user can switch the power on / off, start, pause, cleaning and drying courses and conditions...In the present embodiment, the.front opening.2 side of the.cleaning tank.3 is the front side, the right side is the right side toward the rear from the front side, and the left side is the left side toward the rear side from the front side. I do....Further, in the present embodiment, two tableware baskets are provided, but only one tableware basket may be used depending on the amount of the object to be washed 6 required, and three or more tableware baskets may be provided. It may be provided..Further, in the present embodiment, although the two tableware baskets are made of metal wire, a coated metal or resin material may be used...FIG. 2 is a side sectional view of the door body of the dishwasher according to the first embodiment of the present invention in a state of being pulled out forward. FIG. 3 is a side sectional view of the dishwasher according to the first embodiment of the present invention in a closed state...As shown in FIGS. 2 and 3, the.cleaning tank.3 has a.front opening.2 located on the front surface, a.rear wall.3g facing the.front opening.2 and closing the rear portion of the.cleaning tank.3, and an upper portion of the.cleaning tank.3. It is composed of an.upper wall.3c that closes the upper wall, an.inner bottom.3d that faces the.upper wall.3c, and.side walls.3e and 3f on both the left and right sides of the.cleaning tank.3. The cleaning.space.5 is composed of a substantially rectangular parallelepiped in which the.front opening.2 of the.cleaning tank.3 is closed with a.door body.4 and sealed with water...A.lower cleaning nozzle.10 for cleaning the object to be cleaned 6 on the.lower tableware basket.7 and an.upper cleaning nozzle.11 for cleaning the object to be cleaned 6 on the.upper tableware basket.8 are provided. The.lower tableware basket.7, the.lower cleaning nozzle.10, the.upper tableware basket.8, and the.upper cleaning nozzle.11 are all located in the.cleaning space.5 with the.door body.4 closed...The.lower washing nozzle.10 is rotatably provided below the.lower tableware basket.7 in a substantially central portion when the.lower tableware basket.7 is viewed from above, connected to the.lower headrace channel.12. The.lower cleaning nozzle.10 has a hollow space through which cleaning water passes, and is provided with a plurality of.injection holes.10a on the upper surface for injecting cleaning water toward the object to be cleaned 6 on the.lower tableware basket.7. The.lower cleaning nozzle.10 is rotated by a reaction force generated when the cleaning water supplied from the.lower headrace.12 is injected from the.injection hole.10a...In the present embodiment, the.injection hole.10a is provided only on the upper surface of the.lower cleaning nozzle.10, but after cleaning, an injection hole is provided below so that the cleaning water does not collect in the.lower cleaning nozzle.10. May be...The lower headrace 12 extends substantially horizontally in the front-rear direction, bends downward above the.lower cleaning nozzle.10, and is formed in the shape of a hollow pipe. The lower headrace 12 is fixed to the.lower wire rod.7a of the.lower tableware basket.7 and moves in the front-rear direction together with the.lower tableware basket.7. When the.lower headrace.12 moves forward, the connection between the rear end of the.lower headrace.12 and the pipe-shaped lower.joint portion.13 fixed to the.rear wall.3g of the.washing tank.3 is released. When the.lower tableware basket.7 and the.lower headrace.12 move rearward, the rear end of the.lower headrace.12 is combined with the.lower coupling portion.13, and the washing water can be sent to the.lower washing nozzle.10...The.lower tableware basket.7 is provided above the.lower cleaning nozzle.10 and substantially the.entire cleaning space.5 when viewed from above. The.lower tableware basket.7 is supported on the left and right side surfaces of the.lower tableware basket.7 by a pair of left and right lower tableware basket rails 14 held at the lower part of the inner side surface of the.side walls.3e and 3f on the left and right sides of the.washing tank.3 so as to be movable back and forth. It is configured so that it can be pulled out from the.front opening.2 of the.cleaning tank.3 to the front of the.cleaning tank.3. In the standard state, the.lower tableware basket.7 is configured to store large dishes such as platters, cutting boards, and pans, and cooking utensils...The.upper cleaning nozzle.11 is cantilevered and fixedly supported on the.rear wall.3g of the.cleaning tank.3 via the.upper headrace.15. The.upper washing nozzle.11 is located below the.upper tableware basket.8 when the.door body.4 is closed, and when the.door body.4 is closed, the.upper tableware basket.8 is viewed from above and the upper headwater channel is substantially in the center. It is connected to 15 and is rotatably provided. The.upper cleaning nozzle.11 has a hollow space through which cleaning water passes, and a plurality of.injection holes.11a for injecting cleaning water toward the object to be cleaned 6 on the.upper tableware basket.8 are provided on the upper surface. The.upper cleaning nozzle.11 rotates due to a reaction force generated when the cleaning water supplied from the.upper headrace.15 is injected from the.injection hole.10a...In the present embodiment, the.injection hole.11a is provided only on the upper surface of the.upper cleaning nozzle.11, but after cleaning, an injection hole is provided below so that the cleaning water does not collect in the.upper cleaning nozzle.11. May be...The.upper headrace.15 extends substantially horizontally in the front-rear direction, bends downward above the.upper cleaning nozzle.11, and is formed in the shape of a hollow pipe. At the rear end, the.upper headrace.15 is coupled to an.upper coupling portion.16 having an elbow-shaped pipe fixed to the.rear wall.3g of the.cleaning tank.3, and is cantilevered and fixed to the.rear wall.3g of the.cleaning tank.3. ing. The.upper headrace.15 sends the washing water supplied through the.upper coupling portion.16 to the.upper washing nozzle.11...The.upper tableware basket.8 is provided above the.upper cleaning nozzle.11 when the.door body.4 is closed, and is provided on almost the.entire cleaning tank.3 when viewed from above. The.upper tableware basket.8 is supported on the left and right side surfaces of the.upper tableware basket.8 by a pair of left and right upper tableware basket rails 17 held on the upper part of the inner side surface of the.side walls.3e and 3f on the left and right sides of the.washing tank.3 so as to be movable back and forth. It is configured so that it can be pulled out from the.front opening.2 of the.cleaning tank.3 to the front of the.cleaning tank.3. In the standard state, the.upper tableware basket.8 is configured to store small tableware such as teacups, medium plates with a diameter of 20 cm or less, hot water only, and cups....A.concave drain port.30 is provided at the bottom of the cleaning.space.5 of the.cleaning tank.3. The cleaning.drainage pump.18 is arranged below the outside of the bottom surface of the.cleaning tank.3. The.pump water channel.31 is a path that communicates the.drain port.30 and the.cleaning drainage pump.18. The cleaning.drainage pump.18 sends cleaning water for cleaning the object to be cleaned 6 to the.lower cleaning nozzle.10 and the.upper cleaning nozzle.11 via the.cleaning water channel.32. Further, the.washing drainage pump.18 switches the valve by reversing, and drains the washing water in the.washing tank.3 after washing to the outside of the.dishwasher.1. The washing water sent from the.washing drainage pump.18 passes through the.washing water channel.32, passes through the.water dividing portion.32a divided into two paths, and is sent to the.lower washing nozzle.10 and the.upper washing nozzle.11...In the present embodiment, the.upper headrace.15 is connected to the.upper coupling portion.16 by the.rear wall.3g of the.washing tank.3 and is fixed by cantilever, but like the.lower headrace.12, the upper headrace is fixed. 15 may be fixed to the lower wire of the.upper tableware basket.8 and may be configured to move in the front-rear direction together with the.upper tableware basket.8. According to the configuration, when the height of the.upper tableware basket.8 is adjustable, the height of the upper.head water channel.15 changes together with the height adjustment of the.upper tableware basket.8 to correspond to the height adjustment position. If a plurality of the upper.joint portions.16 are provided on the.rear wall.3 g of the.washing tank.3, the washing water can be sent to the.upper washing nozzle.11 regardless of the height position of the.upper tableware basket.8...Moreover, although cleaning and drainage are operated by one pump, two pumps may be used separately...The.dishwasher.1 of the present embodiment includes a.main tray.20 and an.auxiliary tray.21 that receive water droplets falling from the object to be washed 6 placed on the.lower tableware basket.7 and the.upper tableware basket.8. The.main tray.20 and the.auxiliary tray.21 are pulled forward together with the.door body.4. The.main tray.20 and the.auxiliary tray.21 are arranged with a gap between the.left side wall.3e and the.right side wall.3f of the.cleaning tank.3 so that the.main tray.20 and the.auxiliary tray.21 can be smoothly taken in and out of the.cleaning tank.3 together with the.door body.4. ing. The.main tray.20 is located inside the.washing space.5 when the.door body.4 is closed, and is larger in the left-right direction than the.lower tableware basket.7 when viewed from below the.lower tableware basket.7 and above the.lower tableware basket.7. It is configured in size. The.auxiliary tray.21 is arranged below the.main tray.20, and when the.door body.4 is closed, the.auxiliary tray.21 is stored in the auxiliary.tray storage portion.19 provided below the.cleaning tank.3, and the.cleaning space.5 has an.auxiliary tray.21. Located outside. When the.door body.4 is pulled out, the.auxiliary tray.21 is arranged between the.auxiliary tray.21 and the.main tray.20 in the height direction so as to allow a user's hand of, for example, 5 cm or more to enter...The.main tray.20 is made of a highly rigid resin material and is inclined downward (for example, an inclination angle of 5 degrees) toward the rear. The.main tray.20 is formed in a groove shape so that the peripheral edges facing the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 are higher than the central portion in the left-right direction toward the front surface of the.cleaning tank.3, and is opened upward. ing. The front end portion of the.main tray.20 is detachably fixed to the main.tray claw portion.20a provided on the.door body.4 by claw fitting. The downward inclination of the.main tray.20 toward the rear may be formed at least on the upper surface of the bottom portion, but may be further formed on the lower surface (back surface) of the bottom portion. Further, the downward inclination of the.main tray.20 toward the rear is such that the.main tray.20 is arranged and fixed so as to be inclined downward toward the rear in fixing the front end portion of the.main tray.20 and the.door body.4. It may be configured by. The downward inclination of the.main tray.20 toward the rear is a constant inclination angle in the present embodiment, but it may be composed of a plurality of inclination angles or an inclination angle that gradually and continuously changes. It may be configured...Rotatable tray rollers 23 (rolling support portions) are provided on the left and right sides of the rear end portion of the.main tray.20. The.tray roller.23 supports the.main tray.20 while rolling on the upper surface of the.tray rail.24 provided on the inner side surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3. When the.door body.4 is pulled out, the.main tray.20 is supported by the.tray roller.23 and is pulled out together with the.door body.4...The surface of the.main tray.20 may be coated with a hydrophilic coat. As a result, the washing water adhering to the.main tray.20 is prevented from becoming water droplets and staying on the surface of the.main tray.20, so that it is possible to prevent the washing water from falling on the floor surface....The.auxiliary tray.21 is made of a highly rigid resin material and is arranged substantially horizontally. The.auxiliary tray.21 is composed of a first.auxiliary tray.21a and a second.auxiliary tray.21b provided below the first.auxiliary tray.21a. Both the first.auxiliary tray.21a and the second.auxiliary tray.21b are open at the top. When the.door body.4 is closed, the first.auxiliary tray.21a and the second.auxiliary tray.21b are positioned so as to be vertically overlapped with each other. When the.door body.4 is pulled out, the first.auxiliary tray.21a and the second.auxiliary tray.21b are pulled out together with the.door body.4 while being displaced in the front-rear direction relative to each other...A.seal portion.25 is provided along the outer circumference on the surface (inner surface) of the.door body.4 on the.cleaning tank.3 side. The.seal portion.25 is made of silicon rubber and is hollow, and a rubber magnet having a magnetic force is built in the surface on the.cleaning tank.3 side. The cleaning.tank seal surface.26 of the.cleaning tank.3 facing the.seal portion.25 is made of SUS430, which is a magnetic metal. As a result, when the.door body.4 is closed from the pulled out state, the.seal portion.25 is magnetically pulled into the cleaning.tank sealing surface.26, and the.door body.4 is closed with respect to the.cleaning tank.3 while maintaining watertightness...After the.seal portion.25 is pulled into the cleaning.tank sealing surface.26, the entire surface of the sealing.portion.25 is attracted to the cleaning.tank sealing surface.26 by magnetic force to be sealed. As a result, even if the.door body.4 or the cleaning.tank sealing surface.26 is slightly deformed due to warping or the.door body.4 is tilted forward, the sealing property during cleaning can be ensured, and water to the outside of the cleaning.space.5 can be ensured. Leakage can be prevented...In the present embodiment, the.seal portion.25 is continuously provided in a square shape, but even if the connection of the seal portion is partially broken, the seal between the.door body.4 and the.cleaning tank.3 can be maintained. It suffices if it can be secured...Further, although SUS430 is used as the material of the cleaning.tank sealing surface.26, a magnetic material such as iron may be used, and the front surface of the.cleaning tank.3 other than the cleaning.tank sealing surface.26 may be made of resin or the like. A substance having no magnetism may be used....Further, although the.seal portion.25 is provided on the.door body.4 side, a material having magnetism on the surface of the.door body.4 facing the.cleaning tank.3 side may be used..Further, the cleaning.tank seal surface.26 is configured to be rearward from the.front surface.3a of the.cleaning tank.3. With this configuration, when the cleaning water flowing downward along the cleaning.tank seal surface.26 is received or the.door body.4 is pulled out during cleaning, the.seal portion.25 and the.seal portion.25 are used until the cleaning.drainage pump.18 is stopped. It is possible to receive the cleaning water flowing through the cleaning.tank sealing surface.26 through the gap of the cleaning.tank sealing surface.26...Further, a receiving.portion.27 opened upward is provided on the bottom surface in front of the.cleaning tank.3. As a result, even if some washing water flows, it can be received without overflowing. Further, a.hole.26a is partially provided on the lower cleaning.tank seal surface.26. As a result, the washing water accumulated in the receiving.portion.27 can be returned to the.washing tank.3...A key-shaped.hook.28 is provided on the inner wall of the.door body.4 on the.cleaning space.5 side. A wire rod substantially in the center of the front part of the.lower tableware basket.7 is engaged with the.hook.28, and the.door body.4 and the.lower tableware basket.7 are interlocked so as to be movable back and forth. Further, when the user wants to remove the.lower tableware basket.7, the.lower tableware basket.7 can be easily removed from the.hook.28 by lifting the front wire of the.lower tableware basket.7. Further, an inclined surface is provided behind the.hook.28. As a result, even when the.door body.4 is pulled forward and the.lower tableware basket.7 is removed from the.hook.28 and is located in the.washing tank.3, when the.door body.4 is closed, the.lower tableware basket.7 is in front of the.lower tableware basket.7. When the wire rod goes up the inclined surface of the.hook.28 and the.door body.4 is closed, the front wire rod of the.lower tableware basket.7 is engaged with the.hook.28, and the next time the.door body.4 is pulled out forward, the lower tableware The.basket.7 is also pulled out at the same time...A.water supply valve.29 is arranged above the rear part of the.cleaning tank.3. The washing water is supplied into the.washing tank.3 from the.water supply valve.29 directly connected to the water supply...A.fan.33 is provided below the outer rear portion of the.cleaning tank.3. The.fan.33 operates in a drying process of the.dishwasher.1 or the like, sucks in outside air, and supplies the outside air to the inside of the.washing space.5 from the.air outlet.35 through the.air passage.34. The air supplied to the inside of the cleaning.space.5 is warmed by the.heater.36 located below the cleaning.space.5, dries the object to be cleaned 6 inside the cleaning.space.5, and is provided on the upper surface or the side wall of the.door body.4. It is exhausted from the.exhaust port.37. The.exhaust port.37 may be provided on the top surface or the side wall of the.cleaning tank.3...The.temperature detection unit.38 is arranged in close contact with the outside of the bottom surface of the.cleaning tank.3. The.temperature detection unit.38 indirectly detects the temperatures of the cleaning water, air, and the.heater.36 in the.cleaning tank.3...The.control unit.40 is provided below the bottom surface of the.cleaning tank.3. The.control unit.40 controls the.water supply valve.29 by a signal from the.operation unit.9 operated by the user to control the supply of cleaning water into the.cleaning tank.3, or is based on the output of the.temperature detecting unit.38. In addition to controlling the.heater.36, the washing / draining.pump.18, the.fan.33, and the like are controlled to sequentially execute a series of steps of washing, rinsing, and drying...FIG. 4 is a front sectional view of a main part of the dishwasher according to the first embodiment of the present invention in a closed state...As shown in FIGS. 2 to 4, the washing.water introduction portion.70 is provided on the inner side surfaces of the.side walls.3e and 3f on the left and right sides of the.washing tank.3. The wash.water introduction portion.70 is located above the.main tray.20 and covers the peripheral edge of the.main tray.20. The washing.water introduction portion.70 is provided so as to be inclined downward toward the rear and downward from the inner side surfaces of the.side walls.3e and 3f on the left and right sides of the.washing tank.3. With this configuration, the washing.water introduction unit.70 introduces the washing water during and after washing the.object.6 to be washed into the.main tray.20...Further, the washing.water introduction portion.70 is located above the.tray rail.24 on which the.tray roller.23 provided on the.main tray.20 moves while rolling, and covers the upper surface of the.tray rail.24. With this configuration, the.tray rail.24 is less likely to be exposed to the washing water, and the leftovers and dirt contained in the washing water are less likely to adhere to the.tray rail.24...The downward inclination of the washing.water introduction portion.70 toward the rear and the inclination of the.side walls.3e and 3f on the left and right sides of the.washing tank.3 from the inner side surface to the inward side may be formed at least on the upper surface, but the lower surface (back surface). ) Is also formed. In the present embodiment, the downward inclination of the washing.water introduction portion.70 toward the rear and the inclination of the.side walls.3e and 3f on the left and right sides of the.washing tank.3 from the inner side surface to the inward are constant inclination angles. , It may be composed of a plurality of inclination angles, or it may be composed of an inclination angle that gradually and continuously changes...In the present embodiment, the wash.water introduction unit.70 is formed in a flat plate shape, but the present invention is not limited to this...At the.drain port.30, a.drain filter.50 that collects leftovers such as foods adhering to the.object.6 as dirt in the cleaning step of cleaning the.object.6 to be cleaned and the rinsing step of the.object.6 to be cleaned is provided. It is provided. The.drainage filter.50 includes a.first drainage filter.50a, a.second drainage filter.50b provided around the.first drainage filter.50a, and a third drainage filter formed so as to cover above the.drainage port.30. It is composed of three parts of 50c...The.first drainage filter.50a is formed of a resin material in a cylindrical shape, and has a large number of substantially square holes having a side of about 4.5 mm on the outer peripheral surface and the bottom surface. The.second drainage filter.50b is formed of a stainless steel mesh in a cylindrical shape, and is provided with a large number of substantially square holes having a side of about 4.5 mm on the outer peripheral surface. The.third drainage filter.50c is a stainless steel plate having holes for fitting the.first drainage filter.50a and the.second drainage filter.50b from above and having a large number of punching holes having a diameter of about 1 mm. It is formed. A.pump water channel.31 communicating with the cleaning.drainage pump.18 is connected to the bottom surface of the.drainage port.30 outside the.second drainage filter.50b...FIG. 5A is a front sectional view of a main part in the vicinity of the slide rail in a state where the door body of the dishwasher in the first embodiment of the present invention is closed. FIG. 5B is a cross-sectional view of a main part in a state where the auxiliary tray of the dishwasher according to the first embodiment of the present invention is removed and the door body is pulled out forward...As shown in FIGS. 5A and 5B, the pair of left and right slide rails 60 are fixed to the fixed.rails.60a attached to the left and right inner side surfaces below and outside the cleaning.space.5 of the.cleaning tank.3. It is composed of a first.movable rail.60b slidably mounted on the.rail.60a and a second.movable rail.60c slidably mounted on the first.movable rail.60b...The.door body.4 is fixed to the front end portions of a pair of left and.right angles.61 formed of a metal plate below the.door body.4. The.angle.61 is located on the second.movable rail.60c, and the rear end portion of the.angle.61 is hooked on the.hook portion.60d formed on the second.movable rail.60c and screwed onto the second.movable rail.60c in front of the.angle.61. It is stopped and fixed. When the.door body.4 is pulled forward, the.angle.61 and the second.movable rail.60c are pulled forward from the.front opening.2 of the.cleaning tank.3 while supporting the.door body.4 substantially vertically...The left and right flange portions of the first.auxiliary tray.21a are placed on the.angle.61. The second.auxiliary tray.21b is held by the left and right.tray slide portions.21c of the first.auxiliary tray.21a so as to be slidable in the front-rear direction with respect to the first.auxiliary tray.21a...FIG. 6A is a cross-sectional view of a main part in the vicinity of the auxiliary tray in a state where the door body of the dishwasher in the first embodiment of the present invention is closed. FIG. 6B is a cross-sectional view of a main part in the vicinity of the auxiliary tray in a state where the door body of the dishwasher according to the first embodiment of the present invention is pulled out forward...As shown in FIGS. 6A and 6B, the front portion of the first.auxiliary tray.21a is doord by hooking the rib of the first.auxiliary tray.21a on the.hook portion.4a of the.door body.4. Engages in.body.4. The rear portion of the first.auxiliary tray.21a is detachably fixed to the.angle.61 by fitting the auxiliary.tray claw portion.21d to the.angle.61...When the.door body.4 is pulled out from the closed state, first, the first.auxiliary tray.21a is pulled out together with the.angle.61. After that, the hooking.portion.21e provided behind the first.auxiliary tray.21a and the hooking.portion.21f provided in front of the second.auxiliary tray.21b are engaged with each other, and the second.auxiliary tray.21b is also pulled out forward. Is done...The first.auxiliary tray.21a and the second.auxiliary tray.21b have a.tray slide portion.21c of the first.auxiliary tray.21a and the second.auxiliary tray.21b when the.door body.4 is pulled forward to the limit of the.slide rail.60. In, the length of the anteroposterior relationship between the two is configured so that the overlapping.portion.21g in the anteroposterior direction still remains. As a result, even when the.door body.4 is pulled forward to the limit of the.slide rail.60, the second.auxiliary tray.21b becomes unstable and does not become slanted or come off...Further, the first.auxiliary tray.21a and the second.auxiliary tray.21b are in the left-right direction of the first.auxiliary tray.21a and the second.auxiliary tray.21b when the.door body.4 is pulled forward to the limit of the.slide rail.60. The length of the front-rear relationship between the two and the width dimension in the left-right direction are configured so that the.overlap portion.21 g in the front-rear direction still remains over the entire width of the above. As a result, even when the.door body.4 is pulled forward to the limit of the.slide rail.60, the washing water that falls on the first.auxiliary tray.21a does not fall on the floor surface...By configuring the first.auxiliary tray.21a, the second.auxiliary tray.21b, and the.angle.61 as described above, when the.lower tableware basket.7 and the.upper tableware basket.8 are pulled out forward together with the.door body.4, the first.auxiliary tray.21a, the second.auxiliary tray.21b, and the.angle.61 are configured as described above..Auxiliary tray.21a and 2nd.auxiliary tray.21b are deployed under the.main tray.20 to completely cover a wider area than the.main tray.20 when viewed from above, and prevent water droplets from falling from the.main tray.20 to the floor surface. Can be done...On the contrary, when the.door body.4 is closed from the pulled out state, the first.auxiliary tray.21a is first stored together with the.angle.61 in the auxiliary.tray storage portion.19 below the.washing tank.3. At this time, the second.auxiliary tray.21b does not move backward unless an abnormally large frictional force acts on the.tray slide portion.21c. The first.auxiliary tray.21a and the second.auxiliary tray.21b are displaced in the front-rear direction relative to each other in the.tray slide portion.21c. After that, the front end portion of the second.auxiliary tray.21b and the.inner wall.4b of the.door body.4 come into contact with each other, and the second.auxiliary tray.21b is pushed by the.door body.4 into the auxiliary.tray storage portion.19 below the.cleaning tank.3. It will be stored...The first.auxiliary tray.21a and the second.auxiliary tray.21b are both arranged substantially horizontally. As a result, the water droplets that have fallen on the first.auxiliary tray.21a and the second.auxiliary tray.21b do not concentrate at a specific location, and natural evaporation is promoted. Therefore, it is not necessary to provide a configuration for draining the dropped water droplets, and the user does not have to wipe off the water droplets...As shown in FIGS. 6A and 6B, in the present embodiment, the hooking.portion.21f is configured at the front end portion of the second.auxiliary tray.21b, but is configured at another portion. May be done...Further, a.stopper.3b is provided on the.front surface.3a of the.cleaning tank.3 so that the second.auxiliary tray.21b does not come off from the.cleaning tank.3 forward. When the.door body.4 is pulled out forward, the.stopper.3b and the.hook portion.21h provided behind the second.auxiliary tray.21b come into contact with each other. As a result, the second.auxiliary tray.21b is prevented from moving further forward, and does not come off the.washing tank.3 forward. Further, since the rear end of the second.auxiliary tray.21b does not protrude forward from the.front surface.3a of the.washing tank.3, the washing water falling from the.lower tableware basket.7 and the.upper tableware basket.8 can be dropped onto the floor surface. Can be prevented...Further, in the present embodiment, two.auxiliary trays.21a and 21b are provided, but if a space such as a.drain port.30 and a.washing drainage pump.18 can be secured, one tray may be provided. Further, if a plurality of three or more auxiliary trays are provided, it is possible to secure a wider space for the.drain port.30, the.washing drain pump.18, and the like....Further, although the first.auxiliary tray.21a and the second.auxiliary tray.21b are made of a highly rigid resin material, if the lower part of the.main tray.20 can be covered when the.door body.4 is pulled out forward. Even if the.door body.4 is closed, it can be folded or rolled up using a flexible sheet material such as a thin plate of metal or resin, cloth, or rubber. Good...FIG. 7 is a plan sectional view of a main part in the vicinity of the main tray in a state where the door body of the dishwasher according to the first embodiment of the present invention is pulled out forward...As shown in FIG. 7, the.auxiliary tray.21 is configured to be larger in the left-right direction than the.main tray.20. At the rear of the.main tray.20, a plurality of.rectangular tray outlets.20b having a longitudinal direction in the left-right direction are formed. As shown in FIG. 2, the.tray outlet.20b is provided so as to penetrate the upper surface and the lower surface (back surface) of the bottom portion of the.main tray.20. The.tray outlet.20b drops the washing water and water droplets on the.main tray.20 during and after washing and is guided by the upper surface inclined downward toward the rear of the bottom of the.main tray.20. Lead to the inside of...As shown in FIGS. 2 and 7, a.tray filter.41 provided with a large number of square holes having a side of about 4.5 mm is detachably mounted on the.tray outlet.20b. The.tray filter.41 is a leftovers filter that collects leftovers contained in the washing water flowing on the.main tray.20 at the time of washing through the large number of square holes. Since the.tray filter.41 is detachably mounted on the.main tray.20, when the user pulls out the.door body.4, the.tray filter.41 is also pulled forward, and the leftovers collected by the.tray filter.41 can be easily removed. Can be processed...The.tray filter.41 is optimally configured to be detachably attached to the.main tray.20 as in the present embodiment, but since the.main tray.20 is detachably attached to the.door body.4, the.main tray.41 is detachably attached to the.main tray.20. Even if the 20 is integrally provided, the leftover food treatment is possible...The.tray outlet.20b is positioned behind the.front surface.3a of the.cleaning tank.3 in a state where the.door body.4 is completely pulled out to the front. As a result, even if the washing water that has fallen on the.main tray.20 flows out from the.tray outlet.20b, it does not fall on the receiving.portion.27 of the.washing tank.3 and on the.auxiliary tray.21 or the floor surface. In this way, by configuring the cleaning water so as not to fall on the.auxiliary tray.21 as much as possible, the washing water on the.auxiliary tray.21 can be easily dried by natural evaporation, and the maintenance of the.auxiliary tray.21 can be reduced...The wall surface at the rear portion of the.main tray.20 may be eliminated without providing the.tray outlet.20b so that the cleaning water flows from the rear portion of the.main tray.20 into the.cleaning tank.3...Further, the.drainage filter.50 may be configured to collect coarse leftovers without providing the.tray filter.41...Further, although the.main tray.20 is made of a highly rigid resin material, if the lower part of the.lower tableware basket.7 can be covered when the.door body.4 is pulled out forward, a thin metal or resin plate, cloth, or rubber can be used. When the.door body.4 is closed, the.door body.4 may be folded or rolled up by using a flexible sheet material such as the above...The operation and operation of the.dishwasher.1 configured as described above will be described....When the user pulls the.door body.4 forward from the.dishwasher.1, the.lower tableware basket.7 engaged with the.door body.4 by the.hook.28, the.main tray.20 and the.auxiliary tray.21 move forward in conjunction with the.door body.4. Pulled out to. The user sets the object to be washed 6 in the.lower tableware basket.7. Subsequently, the user pulls out the.upper tableware basket.8, sets the object to be cleaned 6 in the.upper tableware basket.8, and puts the detergent into the.washing tank.3. Then, the cleaning and drying course and conditions are input by the.operation unit.9 on the upper surface of the.door body.4, the power button and the start button are pressed, and the.door body.4 is closed...When the.control unit.40 detects that the.door body.4 is closed by the door body open / close switch (not shown), the.control unit.40 starts the operation...FIG. 8 is a side sectional view showing the flow of washing water in the washing step of the dishwasher according to the first embodiment of the present invention...First, the.washing drainage pump.18 operates to discharge the residual washing water remaining in the.washing tank.3 to the outside of the.dishwasher.1 in the previous operation or the like. Next, the.water supply valve.29 operates, and a predetermined amount of tap water is supplied into the.washing tank.3 as washing water....When a predetermined amount of washing water is supplied, the washing water also flows into the inside of the.washing drainage pump.18 connected by the.pump water channel.31 from the.drainage port.30 together with the detergent. Pressurization by the cleaning.drainage pump.18 is started, the cleaning water in which the detergent is dissolved is sent, and the water is divided by the.water dividing unit.32a. A part of the washing water separated by the.water dividing portion.32a is sent to the.lower washing nozzle.10 via the lower connecting.portion.13 and the.lower headrace.12..The remaining part of the washing water separated by the.water dividing portion.32a is sent to the.upper washing nozzle.11 via the upper connecting.portion.16 and the.upper headrace.15...The cleaning water sent to each cleaning nozzle is ejected upward from the.injection holes.10a provided in the.lower cleaning nozzle.10 and the.injection holes.11a provided in the.upper cleaning nozzle.11 toward the object to be cleaned 6, respectively. At the same time, the reaction forces of the cleaning water injected from the injection holes 10a and the.injection holes.11a are used to rotate the respective cleaning nozzles...Most of the cleaning water sprayed from the.lower cleaning nozzle.10 and the.upper cleaning nozzle.11 to wash the object to be cleaned 6 falls on the.main tray.20 and flows along a downward slope toward the rear. Then, first, the coarse leftovers are strained by the.tray filter.41. Next, the.drainage filter.50 is used to strain fine leftovers. After that, it is collected in the.drain port.30 and flows into the.washing drain pump.18 again through the.pump water channel.31. In this way, the cleaning water in which the detergent is dissolved circulates, and a cleaning step of cleaning the object to be cleaned 6 is performed. In this cleaning step, the.control unit.40 energizes the.heater.36 provided in the.cleaning tank.3 and heats the cleaning water to a predetermined temperature while circulating the cleaning water...At this time, washing water is introduced into the.side walls.3e and 3f on both sides of the.washing tank.3 so as to be inclined downward toward the rear and downward from the inner side surface of the.side walls.3e and 3f toward the.main tray.20. A.part.70 is provided. By the washing.water introduction unit.70, the washing water applied to the inner side surfaces of the.side walls.3e and 3f on both sides of the.washing tank.3 during washing is introduced into the.main tray.20 and passes through the.tray outlet.20b to the.washing tank.3. It flows down to the.inner bottom.3d. Therefore, it is possible to prevent the washing water during washing from flowing into the gap between the.main tray.20 and the wall surface of the.washing tank.3 and adhering dirt and leftovers to the peripheral edge of the.main tray.20...Further, the amount of washing water flowing on the.main tray.20 is stabilized. As a result, dirt and leftovers that have fallen on the washing.main tray.20 on the washing water stream flow to the.tray outlet.20b. As a result, leftovers and dirt do not remain attached to the.main tray.20, and the.main tray.20 can be kept clean and there is no concern about generating an odor...Further, since the amount of washing water flowing through the.main tray.20 is stable and the water force for washing away leftovers and dirt can be maintained, the inclination angle of the.main tray.20 with respect to the horizontal can be reduced. As a result, the space for arranging the.main tray.20 is small, so that large tableware and cooking containers can be efficiently stored...Further, after cleaning, the cleaning water that falls on the cleaning.water introduction unit.70 along the inner surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 is also guided onto the.main tray.20 by the cleaning.water introduction unit.70. As a result, when the.main tray.20 is pulled out as the.door body.4 is pulled out, it is possible to prevent water droplets and leftovers from adhering to the peripheral edge of the.main tray.20 and falling onto the floor surface...For comparison, the flow of the washing water when the washing.water introduction unit.70 for introducing the washing water is not provided in the.main tray.20 will be described. The flow of the washing water that has washed the object to be cleaned 6 passes through the.main tray.20 and flows to the.inner bottom.3d of the.washing tank.3, and the peripheral edge of the.main tray.20 and the.washing tank.3 without passing through the.main tray.20. There is a flow that passes through the gaps between the.side walls.3e and 3f on both the left and right sides of the.washing tank.3 and flows directly to the.inner bottom.3d of the.cleaning tank.3. The flow passing through the gap between the peripheral edge of the.main tray.20 and the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 makes it easy for water droplets and leftovers to adhere to the peripheral edge of the.main tray.20 during cleaning, and the door body after cleaning. When 4 is pulled out, water droplets and leftovers adhering during cleaning fall from the.main tray.20 to the floor surface. Further, by dividing into the above two flows, the amount of water flowing on the.main tray.20 is reduced. As a result, the momentum for washing away dirt and leftovers that have fallen on the.main tray.20 is weakened. Therefore, the.main tray.20 needs to be tilted considerably with respect to the horizontal, an extra space for providing the.main tray.20 is required, and the size and quantity of tableware and cooking containers that can be accommodated are restricted...When the washing step is performed for a predetermined time, the.washing drainage pump.18 discharges the washing water containing the dirt washed off from the.object.6 to be washed out of the.dishwasher.1. Then, the.control unit.40 newly opens the.water supply valve.29 to supply the cleaning water into the.cleaning tank.3, and cleans the water again from the injection holes 10a and the.injection holes.11a provided in the.lower cleaning nozzle.10 and the.upper cleaning nozzle.11. Is sprayed to rinse the object to be cleaned 6 contaminated with detergent, leftovers, etc., and the rinsing step is executed. The flow of the washing water inside the.washing tank.3 in the rinsing step is the same as that in the washing step. Therefore, the action of the washing.water introduction unit.70 is the same as that in the washing step...When this rinsing step is completed, the.washing drainage pump.18 discharges the washing water to the outside of the.dishwasher.1 again. This rinsing process is repeated a plurality of times in succession. Then, after the rinsing step performed a plurality of times, the washing water is heated to a predetermined temperature (for example, 60  C.) by the.heater.36, and the rinsing heating rinsing step is performed...When the heating rinsing step is completed, the drying step is started. In this drying step, the.fan.33 operates, and the outside air is sent into the.cleaning tank.3 from the.air outlet.35 via the.air passage.34. The air sent into the.washing tank.3 is heated by the.heater.36 provided in the downstream direction of the.air outlet.35, then the object to be washed 6 is dried and exhausted from the.exhaust port.37 to the outside of the.dishwasher.1. .. After the drying process is completed, the.control unit.40 ends the operation of the.dishwasher.1 and notifies the user of the end of the operation with a buzzer...After the operation of the.dishwasher.1 is completed, the user pulls out the.lower tableware basket.7 by pulling out the.door body.4 forward, takes out the.dishwasher.6 that has been washed and dried, then pulls out the.upper dishwasher.8 and is washed. Take out the.object.6...As described above, the.dishwasher.1 in the present embodiment includes a.washing tank.3 having a.front opening.2, a.door body.4 that covers the.front opening.2 of the.washing tank.3 and can be pulled out forward, and a.washing tank.3. A cleaning.space.5 formed by the.door body.4, a.lower tableware basket.7 housed in the.cleaning space.5, and a.lower cleaning nozzle.10 for cleaning the object to be cleaned such as tableware stored in the.lower tableware basket.7. A.main tray.20 and an.auxiliary tray.21 are provided together with the.door body.4, the.main tray.20 is provided below the.lower tableware basket.7 in the.washing space.5, and the.auxiliary tray.21 is washed below the.main tray.20. It is provided outside the.space.5...When the cleaning process starts and the drying process ends, water droplets remain not only in the object to be cleaned 6 and the.cleaning tank.3, but also on the back surface of the.main tray.20, and when the.door body.4 is pulled out in that state, Water droplets adhering to the back surface of the.main tray.20 may fall down. In the.dishwasher.1 of the present embodiment, the.auxiliary tray.21 can receive the water droplets due to the above configuration, so that the water droplets can be prevented from falling on the floor surface. Further, since only water droplets fall on the.auxiliary tray.21, it is possible to provide a hygienic dishwasher in which dirt does not accumulate and the space in which the.auxiliary tray.21 and the.auxiliary tray.21 are stored does not become an unclean environment. ....Further, by making the.auxiliary tray.21 wider in the left-right direction than the.main tray.20, when the.door body.4 is pulled out, the.auxiliary tray.21 can reliably receive water droplets falling from the back surface of the.main tray.20. It is possible to prevent water droplets from falling on the floor surface...Further, since the.lower tableware basket.7 is pulled out forward together with the.door body.4, the.lower tableware basket.7 is pulled out forward only by the action of the user pulling out the.door body.4, and the user bother to pull out the.lower tableware basket.7. The object to be washed 6 can be set in the.lower tableware basket.7...Further, by making the.main tray.20 and the.auxiliary tray.21 removable, the user can remove the.main tray.20 and the.auxiliary tray.21 and wash them completely, and keep the.main tray.20 and the.auxiliary tray.21 hygienic. Can be done...Further, the gap between the.main tray.20 and the.auxiliary tray.21 when the.door body.4 is pulled out is set to a distance of 5 cm or more so that the user can enter the gap between the.main tray.20 and the.auxiliary tray.21. The lower surface of the.main tray.20 and the upper surface of the.auxiliary tray.21 can be easily cleaned without removing the.main tray.20 by putting a hand, and the.main tray.20 and the.auxiliary tray.21 can be kept hygienic...Further, since the.auxiliary tray.21 is composed of two trays, the first.auxiliary tray.21a and the second.auxiliary tray.21b, the area occupied by the.auxiliary tray.21 in the horizontal direction is reduced when the.door body.4 is closed. It is possible to secure a wide space for the.drain port.30, the.washing drain pump.18, and the like...Further, the first.auxiliary tray.21a and the second.auxiliary tray.21b were stacked and stored in the vertical direction when the.door body.4 covered the.front opening.2 of the.washing tank.3, and the.door body.4 was pulled out. Occasionally, by deploying in the pull-out direction, it is possible to secure a large space for the.drain port.30, the.washing drain pump.18, etc. without bending or bending the.auxiliary tray.21, and to provide a small dishwasher. be able to...Further, when the.door body.4 is pulled out and the.auxiliary tray.21 is deployed in the pull-out direction, the.overlap portion.21g is configured to exist between the first.auxiliary tray.21a and the second.auxiliary tray.21b. As a result, even when the.door body.4 is pulled forward to the limit of the.slide rail.60, the second.auxiliary tray.21b can be prevented from becoming unstable and tilting or coming off. In addition, it is possible to prevent the washing water that falls on the first.auxiliary tray.21a from falling onto the floor surface....Further, when the.door body.4 is pulled out and the.auxiliary tray.21 is expanded in the pull-out direction, the second.auxiliary tray.21b is cleaned by the.stopper.3b provided on the.front surface.3a of the.cleaning tank.3 with the.rear hooking portion.21h. The position is restricted behind the.front surface.3a of the.tank.3. As a result, the second.auxiliary tray.21b does not come off the.cleaning tank.3 forward. Further, since the rear end of the second.auxiliary tray.21b does not protrude forward from the.front surface.3a of the.washing tank.3, the.lower tableware basket.7.In addition, it is possible to prevent the washing water that falls from the.upper tableware basket.8 from falling onto the floor surface...Further, the.main tray.20 is formed or arranged so that the upper surface of the bottom portion is inclined downward toward the rear, and the.tray outlet.20b is provided at the rear portion of the.main tray.20 so as to penetrate the upper surface and the lower surface of the bottom portion. .. As a result, the cleaning water and water droplets falling on the.main tray.20 are surely guided into the.cleaning tank.3 by the inclination of the upper surface of the bottom surface of the.main tray.20 and the.tray outlet.20b, not only during the cleaning but also after the cleaning is completed. Can be done. As a result, during cleaning, the circulation of the cleaning water can be improved and the cleaning performance can be improved. Further, after the cleaning is completed, the cleaning water and water droplets falling on the.main tray.20 can be promptly removed from the.main tray.20 and moved into the.cleaning tank.3, and when the.door body.4 is pulled out. In addition, it is possible to prevent the washing water and water droplets from falling on the floor surface...Further, the.tray outlet.20b of the.main tray.20 is configured to be located behind the.front surface.3a of the.cleaning tank.3 when the.door body.4 is completely pulled out. With this configuration, even when the.door body.4 is completely pulled out, the washing water and water droplets falling on the.main tray.20 can be reliably stored in the.washing tank.3. Therefore, regardless of the position of the.main tray.20 drawn out together with the.door body.4, the washing water and water droplets falling on the.main tray.20 can be reliably moved into the.washing tank.3 by the.tray outlet.20b. It is possible to prevent the washing water that falls from the tableware basket from falling onto the floor surface...Further, the.main tray.20 is provided with a.tray filter.41 for collecting leftovers contained in the washing water at the.tray outlet.20b. By pulling out the.tray filter.41 forward together with the.door body.4, the user can easily process the leftover food. Further, since the.tray filter.41 is provided on the upstream side of the flow of the washing water from the.drainage filter.50 located at the lowermost part of the.washing tank.3, the accumulation of leftovers on the.drainage filter.50, which is difficult to treat the leftovers, is reduced. However, it is possible to reduce the trouble of processing leftovers by the user...Further, the.main tray.20 includes a.tray roller.23 that supports the.main tray.20 while rolling with respect to the.washing tank.3. As a result, even in a configuration in which the.main tray.20 is cantilevered and supported by the.door body.4, the.main tray.20 can be smoothly moved back and forth while being stably supported. As a result, when the.main tray.20 is pulled forward together with the.door body.4, the vibration of the.main tray.20 can be suppressed, and the water droplets adhering to the.main tray.20 can be suppressed from scattering to the surroundings. Further, during cleaning, the deformation of the.main tray.20 with respect to the load of the cleaning water falling on the.main tray.20 is suppressed, and the back surface of the.main tray.20 is prevented from being immersed in the cleaning water flowing into the.inner bottom.3d of the.cleaning tank.3. Can be done...Further, on the inner side surfaces of the left and.right side walls.3e and 3f of the.washing tank.3, a washing.water introduction portion.70 for introducing the washing water into the.main tray.20 is provided. With this configuration, the cleaning water applied to the inner side surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 during cleaning is introduced into the.main tray.20 and passes through the.tray outlet.20b to pass through the.tray outlet.20b to the.inner bottom.3d of the.cleaning tank.3. It runs down to. Therefore, it is possible to prevent the washing water during washing from flowing into the gap between the.main tray.20 and the wall surface of the.washing tank.3 and adhering dirt and leftovers to the peripheral edge of the.main tray.20. Further, it is possible to stabilize the amount of washing water flowing on the.main tray.20 and prevent leftovers and dirt from remaining on the.main tray.20. Further, even after cleaning, the cleaning water that falls on the cleaning.water introduction portion.70 along the inner surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 is also guided onto the.main tray.20 in the same manner, and the.main tray.20 It is possible to prevent water droplets and leftovers from adhering to the peripheral edge and falling onto the floor surface....Further, the washing.water introduction portion.70 is provided above the.main tray.20 so as to cover the peripheral edge of the.main tray.20. With this configuration, the washing water during washing is surely introduced onto the.main tray.20, flows into the gap between the.main tray.20 and the wall surface of the.washing tank.3, and leftovers and dirt adhere to the peripheral edge of the.main tray.20. It can be suppressed...Further, the washing.water introduction portion.70 is provided above the.tray rail.24 so as to cover the.tray rail.24 on which the.main tray.20 moves. With this configuration, it is possible to prevent leftovers and dirt from adhering to the.tray rail.24 and hindering the movement of the.main tray.20 in the front-rear direction...Further, the washing.water introduction portion.70 is provided so as to be inclined downward toward the rear. With this configuration, the cleaning water applied to the inner surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 during cleaning is concentrated as much as possible on the rear portion of the.main tray.20 provided with the.tray outlet.20b and the.tray filter.41. It can be introduced and dropped onto the.inner bottom.3d of the.cleaning tank.3. As a result, it is possible to prevent leftovers and dirt from remaining on the upper surface of the.main tray.20. In addition, it is possible to prevent water droplets, leftovers, and dirt from remaining on the surface of the washing.water introduction portion.70 after washing...Further, the washing.water introduction portion.70 is provided so as to be inclined downward toward the inside of the.washing tank.3. With this configuration, the cleaning water applied to the inner side surfaces of the.side walls.3e and 3f on the left and right sides of the.cleaning tank.3 can be reliably guided onto the.main tray.20 during cleaning. In addition, it is possible to prevent water droplets, leftovers, and dirt from remaining on the surface of the washing.water introduction portion.70 after washing...In the present embodiment, the.lower headrace.12 and the.main tray.20 are provided independently, but the.lower headrace.12 is integrally formed with the.main tray.20, and the.lower cleaning nozzle.10 is provided as the lower headrace. If it is provided above 12, it is not necessary to deform the shape of the.lower tableware basket.7 in a convex shape in order to avoid the shape of the.lower headrace.12, and there are few restrictions on the placement of the object to be cleaned 6 on the.lower tableware basket.7. Become...Further, in the present embodiment, the washing.water introduction part.70 is provided on the left and.right side walls.3e and 3f of the.washing tank.3, but the same washing water introduction part is also provided on the inner side surface of the.door body.4. You may be...As described above, the dishwasher according to the present invention can prevent water droplets falling from the object to be washed placed on the dishwasher when the dishwasher is pulled out forward from falling on the floor surface. In addition, it is possible to prevent the dirt that has fallen from the object to be cleaned from accumulating and creating an unclean environment. Therefore, it is not only useful as a drawer-type dishwasher, but also applicable to applications such as washing machines using a drawer mechanism..  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .1.Dishwasher.2.Front opening.3.Washing tank.3a Front 3e,.3f Side wall.4.Door.5.Washing space.7.Lower tableware basket.8.Upper tableware basket.10.Lower washing nozzle.11.Upper washing nozzle.18 Washing drainage pump 19.Auxiliary tray storage.20.Main tray.20b Tray outlet.21.Auxiliary tray.21a First.auxiliary tray.21b Second.auxiliary tray.23 Tray roller (rolling support).24.Tray rail.41 Tray filter (leftover filter).70 Washing water introduction part"
}